posts/2021-01-20-aoc/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 29 May. 2021 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Reflecting on The Advent of CTF</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Arjen 'credmp' Wiersma">
<meta description='The blog of Arjen Wiersma'/>
<link rel='alternate' type='application+rss/xml' title='The blog of Arjen Wiersma' href='posts/rss.xml'/>
<link rel="stylesheet" href="../../css/GTD.css?v=76976d55497000bc7c0ec3a55cd8fee7709aaf0a69319efb7a796480448fa7bd" type="text/css">
</head>
<body>
<main id="content">
<header>
<h1 class="title">Reflecting on The Advent of CTF</h1>
<p class="subtitle">Hosting a month long CTF</p>
</header>
<section id="outline-container-org92fc553" class="outline-2">
<h2 id="org92fc553">The end of a month</h2>
<div class="outline-text-2" id="text-org92fc553">
<p>
On December 24 the last puzzle went live. It was quite an amazing experience. Over 500 people participated in the daily puzzles.
</p>

<p>
During the event several opportunities to give away prizes presented themselves. The CTF had 3 prizes to give away by <a href="https://www.hackthebox.eu">Hack The Box</a> and an awesome Challenge Coin presented by <a href="https://www.novi.nl">NOVI Hogeschool</a>, my employer. Once the coins are available I will blog about them, for now you will just have to believe they are awesome!
</p>

<p>
During the last Hack The Box NL Meetup I gave a talk about the infrastructure and my experiences with hosting such a big event. The talk is linked below.
</p>

<p>
Some interesting posts I created along the way are linked below:
</p>

<dl class="org-dl">
<dt><a href="./../../writeups/advent-of-ctf/stats/index.html">Statistics for the Top 20 finishers</a></dt><dd>Every day I calculated the time the top 20 needed to finish the challenges. This is a good indicator for the complexity of the challenges.</dd>
<dt><a href="./../../writeups/advent-of-ctf/index.html">The write-ups</a></dt><dd>Each challenge has its own write-up, including custom artwork for the challenge.</dd>
</dl>
</div>
</section>

<section id="outline-container-org75b6fcc" class="outline-2">
<h2 id="org75b6fcc">The Talk</h2>
<div class="outline-text-2" id="text-org75b6fcc">
<p>
Included here is the talk I gave at the January meetup. It goes into detail about the infrastructure, the pitfalls of creating challenges and hosting an event that starts at 8am each day.
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/FMXxMWFMOC8?start=160" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</section>

<section id="outline-container-org6fc7b22" class="outline-2">
<h2 id="org6fc7b22">The code</h2>
<div class="outline-text-2" id="text-org6fc7b22">
<p>
I have put all the challenges up on <a href="https://github.com/adventofctf/2020">Github</a> so you can run them yourself. They are based on docker containers, so the experience will be the same as during the event, minus the anti-cheat measures detailed in the video.
</p>

<p>
Go back to the <a href="../../index.html">homepage</a>.
</p>
</div>
</section>
</main>
</body>
</html>
